# Ввод матрицы
m = []
print("Вводите строки матрицы (enter после каждой строки). Элементы в строке разделяйте пробелами")
for i in range(3):
    b = list(input().split())
    m.append(b)
for i in range(3):
    for j in range(3):
        m[i][j] = float(m[i][j])
# расчет коэффициентов для характеристического уравнения
A = -1
B = m[0][0] + m[1][1] + m[2][2]
C = m[2][0]*m[0][2] + m[2][1]*m[1][2] + m[0][1]*m[1][0] - m[1][1]*m[2][2] - m[0][0]*m[2][2] - m[0][0]*m[1][1]
D = m[2][0]*m[0][1]*m[1][2] + m[1][0]*m[2][1]*m[0][2] + m[1][1]*m[2][2]*m[0][0] - m[0][2]*m[2][0]*m[1][1] - m[2][1]*m[1][2]*m[0][0] - m[1][0]*m[0][1]*m[2][2]
if B >= 0:
    B = '+ ' + str(B)
if C >= 0:
    C = '+ ' + str(C)
if D >= 0:
    D = '+ ' + str(D)

print (A,'xxx ', B,'xx ', C,'x ', D, sep = '')