# Матрица А размера 3*3
print('Ввод матрицы А:')
A = [list(map(float, input().split())) for i in range(3)]
m = len(A[0])

# Проверка матрицы  А
for i in range(len(A)):
    if m != 3 or m != len(A[i]):
        print('Матрица некорректна')
        exit(0)

# Коэффициент перед x^3 всегда равен -1

# Коэффициент перед x^2
b = A[0][0] + A[1][1] + A[2][2]

# Коэффициент перед x
c = A[0][2] * A[2][0] + A[1][2] * A[2][1] + A[0][1] * A[1][0] - A[0][0] * A[1][1] - A[0][0] * A[2][2] - A[1][1] * A[2][
    2]

# Свободный коэффициент
d = A[0][0] * A[1][1] * A[2][2] + A[0][1] * A[1][2] * A[2][0] + A[0][2] * A[1][0] * A[2][1] - A[0][2] * A[1][1] * A[2][
    0] - A[0][0] * A[1][2] * A[2][1] - A[0][1] * A[1][0] * A[2][2]

K = [b, c, d]

if b.is_integer():
    b = int(b)
if c.is_integer():
    c = int(c)
if d.is_integer():
    d = int(d)

print('Характеристическое уравнение: -xxx + (', b, ') xx + (', c, ') x + (', d, ')')
